player = {
"name":"",
"hp":200,
"attack":50,
"def":10,
"luck":5
}

vrags = [

   
        {"name": "Грибочек",
        "hp":70,
        "def":2,
        "attack":20,
        "script":"Не бей меня я маленький миленький грибочек",
        "win":"За что ты меня убил?",
        "lose":"Я же сказал чтобы ты меня не трогал"},

    {"name":"Огромный грибочек",
        "hp":250,
        "def":15,
        "attack":40,
        "script":"Не надо было убивать моего друга грибочка.Я тебе отомщу за него",
        "win":"Ты умрешь если пойдешь дальше",
        "lose":"Я же сказал что отомщу за грибочка.Не надо было лесть ко мне слабачок"},
    
    {"name":"Королева грибочков",
     "hp":400,
     "def":20,
     "attack":65,
     "script":"Как ты посмел тронуть моих поданных.Ты ответишь за каждого из них",
     "win":"",
     "lose":""},

    {"name":"Древний гриб",
      "hp":500,
      "def":25,
      "attack":100,
      "script":"Не трогай старого беззащитного дедушку гриба.Мне и так не долго осталось",
      "win":"Прощай маленький герой.Спрасибо что развеселил старика на последок",
      "lose":"Ну я же просил тебя не трогать меня.До скорых всреч с тобой"}
]